{
	"entries":[
		{
		"date":"04/13/2015",
		"title":"Command Line Fu",
		"text":"As a new arrival on the techscape today has abeen a whirlwind of acronyms, ideas, and keystrokes. The most fascinating thing to me as a new user is the command line. With a few well chosen commands and some usefull help pages I was able to begin to unveil the frighteningly massive amount of information behind the shiny buttons and helpful tooltips in the GUI. I am finding that the ability to find what I want and then interact directly with the machine to accomplish my task is incredibly helpful in the learning process. Many (ok, almost all) of the things I saw today don'tmake complete sense, but the concepts don't seem as vague, and I see now that I can unlock the mystery with some hard work. For now, if only this worked. <br/>~/sudo apt-get install all_the_answers<br/>-Brandon Brown"
		},
		{
		"date":"04/14/2015",
		"title":"Booleans, Binary and bash",
		"text":"Today was much more of a nuts and bolts type of day which I like, but it does cause more brain pain. Working with if statements seems simple enough on the chalk board, but the execution is quite elusive. Learned quite a bit about lists, indexing and removing items from them, calling specific peices of them, and even storing dynamic variables in them. Work on creating the dice game has caused me to realized truly how little knowledge I posess, yet succeeding in the creation of a digital 6 sided dice gave me way more joy than I feel it should have. I'm surprised to learn I retained much of the information I learned yesterday, and dealing with the git bash terminal came much more easily to me. I still have some problems with my file structure and getting the proper repositories in the right spots, but I feel confident that given a week or two the clouds will start to break and I may be able to enjoy some lucidity when it comes to these concepts. <br/>-Brandon Brown <br/>-SudoPriest Acolyte"
		},
                {
		"date":"04/15/2015",
		"title":"My life is a lie, code is truth.",
		"text":"The computer only does what you tell it to do. Sounds easy, but what happens when you have no idea what you told the damned thing to do. Or what if you told it to do one thing and it does another. What do you change? What do you keep? Today was an exercise in print commands. I have decided that, for now, there can never be too many print statements. Yes, it is cumbersome. Yes, #'s become very important. But I found that my understanding of what I was doing grew exponentially the more I painstakingly forced my code to tell me exactly what it was doing, and to write out the answers that it was recieving. I don't feel more confident in my ability to understand what I'm doing than I did yesterday. But I begin to see that I WILL understand it with more exposure. <br/>-Brandon Brown  <br/>:wq"
		},
                {
		"date":"04/16/2015",
		"title":"Form and Function()",
		"text":"I wish I had more to say but I don't. Today I saw a function. I think I can see how it could be used. But I can't see much farther than that. Trying to actually put something useful on the screen today has been rather nightmareish. When I did actually start trying to write some code with functions, I couldn't help but feel that I was creating busy work for no real reason. My brain can't grasp the design concept well enough to plan out what functions I would need, and then also design the functions to interact correctly as I go along. As soon as I finished one, I realized i needed another one. Or, conversely, I would realize that I had made a useless or combersome function that had no place in the code. Frustrated and sleepy. <br/>Brandon Brown <br/>~/sudo shutdown -h now"
		},
		{
		"date":"04/17/2015",
		"title":"This stuff is loopy",
		"text":"I am quite happy that it is friday. But maybe not for the reason that you think. After the onslought of information, nay the veritable deluge of data, I need some time to go through all the key words I have written down, the key concepts I have tucked away for future reference need to be referenced, and the trailing lines of my thought processes need to be solidified into actual knowledge I can do something with, rather than a string of copy paste commands that my brain can run. I am jazzed and invigorated, and I can't wait to learn more. If only my brain could keep up with my heart. I must content myself with the knowledge that I am making progress, and whether I feel that it is fast enough or not. <br/> for int in brain:<br/>    print brain<br/>None<br/><br/>-Brandon Brown<br/>:wq'"
		},
		{
		"date":"04/20/2015",
		"title":"A day of win",
		"text":"Today was a day in which I allowed myself to just accept where I was at as for as learning was concerned, and it was a good decision. Despite my apparent lack of progress I discovered that the information was indeed slowly seeping into my skull. I wrote a piece of code to allow me to pick up a data stream from twitter, and it only took my two tries to get it to work. Thats a win. I also succeeded in wrapping my head more firmly around the design principles I have been struggling to learn, and subsequently the code has gone from a foreign language I've never seen before to a system that I can visualize, albeit not well or smoothly, but visualize none the less. I'm happy, I'm triumphant, I'm ready to learn more.<br/>-Brandon Brown<br/>:wq"
		}
	]
}
