{
	"entries":[
		{
		"date":"04/13/2015",
		"title":"Command Line Fu",
		"text":"As a new arrival on the techscape today has abeen a whirlwind of acronyms, ideas, and keystrokes. The most fascinating thing to me as a new user is the command line. With a few well chosen commands and some usefull help pages I was able to begin to unveil the frighteningly massive amount of information behind the shiny buttons and helpful tooltips in the GUI. I am finding that the ability to find what I want and then interact directly with the machine to accomplish my task is incredibly helpful in the learning process. Many (ok, almost all) of the things I saw today don'tmake complete sense, but the concepts don't seem as vague, and I see now that I can unlock the mystery with some hard work. For now, if only this worked. <br/>~/sudo apt-get install all_the_answers<br/>-Brandon Brown"
		},
		{
		"date":"04/14/2015",
		"title":"Booleans, Binary and bash",
		"text":"Today was much more of a nuts and bolts type of day which I like, but it does cause more brain pain. Working with if statements seems simple enough on the chalk board, but the execution is quite elusive. Learned quite a bit about lists, indexing and removing items from them, calling specific peices of them, and even storing dynamic variables in them. Work on creating the dice game has caused me to realized truly how little knowledge I posess, yet succeeding in the creation of a digital 6 sided dice gave me way more joy than I feel it should have. I'm surprised to learn I retained much of the information I learned yesterday, and dealing with the git bash terminal came much more easily to me. I still have some problems with my file structure and getting the proper repositories in the right spots, but I feel confident that given a week or two the clouds will start to break and I may be able to enjoy some lucidity when it comes to these concepts. <br/>-Brandon Brown <br/>-SudoPriest Acolyte"
		},
        {
		"date":"04/15/2015",
		"title":"My life is a lie, code is truth.",
		"text":"The computer only does what you tell it to do. Sounds easy, but what happens when you have no idea what you told the damned thing to do. Or what if you told it to do one thing and it does another. What do you change? What do you keep? Today was an exercise in print commands. I have decided that, for now, there can never be too many print statements. Yes, it is cumbersome. Yes, #'s become very important. But I found that my understanding of what I was doing grew exponentially the more I painstakingly forced my code to tell me exactly what it was doing, and to write out the answers that it was recieving. I don't feel more confident in my ability to understand what I'm doing than I did yesterday. But I begin to see that I WILL understand it with more exposure. <br/>-Brandon Brown  <br/>:wq"
		},
        {
		"date":"04/16/2015",
		"title":"Form and Function()",
		"text":"I wish I had more to say but I don't. Today I saw a function. I think I can see how it could be used. But I can't see much farther than that. Trying to actually put something useful on the screen today has been rather nightmareish. When I did actually start trying to write some code with functions, I couldn't help but feel that I was creating busy work for no real reason. My brain can't grasp the design concept well enough to plan out what functions I would need, and then also design the functions to interact correctly as I go along. As soon as I finished one, I realized i needed another one. Or, conversely, I would realize that I had made a useless or combersome function that had no place in the code. Frustrated and sleepy. <br/>Brandon Brown <br/>~/sudo shutdown -h now"
		},
		{
		"date":"04/17/2015",
		"title":"This stuff is loopy",
		"text":"I am quite happy that it is friday. But maybe not for the reason that you think. After the onslought of information, nay the veritable deluge of data, I need some time to go through all the key words I have written down, the key concepts I have tucked away for future reference need to be referenced, and the trailing lines of my thought processes need to be solidified into actual knowledge I can do something with, rather than a string of copy paste commands that my brain can run. I am jazzed and invigorated, and I can't wait to learn more. If only my brain could keep up with my heart. I must content myself with the knowledge that I am making progress, and whether I feel that it is fast enough or not.<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"04/20/2015",
		"title":"A day of win",
		"text":"Today was a day in which I allowed myself to just accept where I was at as for as learning was concerned, and it was a good decision. Despite my apparent lack of progress I discovered that the information was indeed slowly seeping into my skull. I wrote a piece of code to allow me to pick up a data stream from twitter, and it only took my two tries to get it to work. Thats a win. I also succeeded in wrapping my head more firmly around the design principles I have been struggling to learn, and subsequently the code has gone from a foreign language I've never seen before to a system that I can visualize, albeit not well or smoothly, but visualize none the less. I'm happy, I'm triumphant, I'm ready to learn more.<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"04/21/2015",
		"title":"Patience is not my virtue",
		"text":"I have made a lot of great striding steps in my own personal developement in the last week. I have begun to learn a new written language, a new operating system, and I am implementing a new organizational tool for manageing my time and tasks. I've done really well, and can see improvement already. But for some reason it just isn't enough for me. I understand on the conceptual level that I should be ecstatic about my progress thus far, that I expect to improve too quickly. But the fact remains that it isn't good enough. The ideas don't present themselves to me. This stuff isn't even close to being intuitive to me, and because I take so long to solve the labs, my project falls behind. I feel worthless for spending time on lab, yet I can't justify doing my own research until the lab is finished, and now I stand at the end of the day with an incomplete lab and a piece of code that I didn't add one line to all day. I guess the only thing left to do is clear my head, and hope that after my brain cools off it's had a chance to process the question in a different way.<br/>-Brandon Brown<br/>:q!"
		},
		{
		"date":"04/22/2015",
		"title":"The turtle wins, but the penguin is supreme.",
		"text":"I spent a lot of time reading today. I began to realize that I have been in error in my thinking of late. I have been beating myself up because I haven't felt I've gotten enough words on the screen. I felt like I was spending to much time reading and not enough time doing. But I realized today that if I read with focus and clarity,(as opposed to speed and a manic need to find the answer im looking for), I remember and internalize a lot more. I need to slow down and let myself catch up. It was quite a revelation, almost as wonderful as seeing the actual proof that with enough time spent, progress quietly moves in, unassuming and low key. I wouldn't have even noticed it if I wasn't looking for something to write about. I still have a lot of work ahead of me this evening, but I have a clear vision, and that sets my mind at ease."
        },
		{
		"date":"04/23/2015",
		"title":"The first break down is communication.",
		"text":"I learned a lot in the past few days about working with a team. There are the obvious things like communication, (mentioned in the title), and cooperation. Enough has been said by many smarter people than I about those sorts of things, so I will let it be. It's the inobvious things that I wish to speak of. Things like design structure, team mentality and direction, standards that everyone can adhere to. Try group coding a python program, and every time you check something out from github it won't run because everyone but you is using tab. I try understanding a program that has been cobbled together from a grouping of poorly built functions that have been shoved into a class. Or try spending a day and a half working on a piece of functionality only to find out that we all missunderstood the requirements. Using source control at this point with the newness of all of the students here just makes trying to do anything a nightmare. Now to hopefully work on my sadly neglected personal project. <br/> -Brandon Brown"
		},		
		{
		"date":"04/24/2015",
		"title":"self.reflection()",
		"text":"This week has not been easy, but it has been good. I am sleep deprived, over stimulated, and fatigued, but I am invigorated. I didn't finish what I set out to do on monday, but I my progress was outstanding and rewarding. I experienced one of the greatest feelings in my life today. I am truly content for once in my life, and it spawned from such a simple thing: I gave it my all. There was nothing more to give. I don't think I have ever truly given my best effort to anything in my life. And even though I failed to complete some things, the knowledge that I put 100% of my effort into allows me to be satisfied with my effort. Even proud of it. This is a good day. <br/>-Brandon Brown<br/>Break"
        },
		{
		"date":"04/27/2015",
		"title":"Gambling",
		"text":"I finally got the time to sit down and truly immerse myself in my code today. It was a great experience, but also an eye opening one. It was interesting how hard it was to get back in to the flow of the code and the mindset that I was in while writing. I found myself having to run and re-run through the program in order to have any idea what was going on, even though I was the one who wrote the thing in the first place. But I did find that the longer I spent working on it, the more the concepts reinforced themselves in my mind. This is frustrating because even though I truly desire to know these things right now, I know that there is no substitute for time. And that realization doesn't make me feel any better.<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"04/28/2015",
		"title":"Snakes on a Plane",
		"text":"We finished the python core curriculum today, and I am happy to say that I am incredibly excited to keep learning python! Today I built a program that could listen to the twitter stream, and when it found a specific word inside a given tweet, would reply to that user with a tweet of my own. I also built a game that would allow the user to guess a number that the computer had picked, with only a higher or lower indicator after each input. I consistantly and diligently continued to build on my personal project, and I can feel the language and the mindset resolving itself in me. Tomorrow we begin our foray into JavaScript, and though it is unknown terratory, it is an adventure I can't wait to dive into... After I read some more about Python of course.<br/>-Brandon Brown<br/>Import This"
		},
		{
		"date":"04/29/2015",
		"title":"Coming along",
		"text":"Today we got a crash course in HTML, and then spent the day trying to make a web page look like another webpage. I am frustrated by the fact that although I have followed the steps there is one thing that will not be fixed, no matter how much I fight with it. One thing I like about this new topic is I get an opportunity to see my changes as I make them, which reinforces the feeling that I am creating something tangible. Let us hope that this trend continues. I was also able to put some time into my online presence today, so don't forget to follow me on twitter. @sudopriest<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"04/30/2015",
		"title":"JavaScript != Python",
		"text":"Today was all about JavaScript, and an interesting day it has been. Having a little bit of foundation in Python and the 'principles of programming' made learning the new syntax fairly easy, and the primer on html and css from yesterday was invaluable in giving me context in which to think about what I was doing with JavaScript. Both good things, but it doesn't change the fact that I'm sick of {}'s and ;'s. I was surprised at the speed with which I picked up the basic operations, such as for and while loops, if and switch statements and declaring variables and objects, but am disappointed to find that in order to get things done there is still alot of slow, meticulous reading and fiddling about(who knew?). I am getting the hang of the learning process though and consequently I can focus more and more clearly.<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"05/01/2015",
		"title":"3D arrays on a 2D screen",
		"text":"I am pleased to record that my efforts today have been incredibly fruitful. The lab on using the Date() object in JavaScript that gave me so much trouble yesterday was much easier to understand with a fresh mind this morning. And the various exercises and coding challenges were easy to break down and think out. I may actually have begun to think like a developer in some deep part of my brain. Most of the work today had to do with using loops to parse through multidimensional arrays, and after a little experimentation I was able to wrap my brain around the concepts fairly quickly. More and more I am realizing the value of trying things out. If it makes sense to you that it should work a specific way, then code it that way and see why it breaks, fix what you think is wrong and try it again. Rinse, Repeat. It sounds tedious, and to an extent it is. But I've found that the more I force myself to go through it, the less I have to fiddle around on the next problem I encounter. For now I'm happy with my progress this week, I'm happy that it is friday, and I'm excited to work on my own projects this week.<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"05/04/2015",
		"title":"js dysfunction()",
		"text":"I started to actually dive in to using JavaScript on a web page today, and honestly it is more of the same. Google search, try potential solution, google search, try potential solution number 2... and so on. I worked on sourcing a .js file from an Html file, and calling javascript functions from an Html file. The understanding of what is actually going on is still elusive, but I made some things happen, which is cool. Each triumph is quickly overshadowed by the next problem, however, and overall it has been a rather slow day. The only other thing worth bringing attention to is the fact that I hate when I can't tell why what I coded is doing something I don't want it to do.<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"05/05/2015",
		"title":"blogPost",
		"text":"JQuery is quite good at finding things. I am aware that it is quite good at much more than finding things, but for today I am comfortable with, It's good at finding things. Today was all about using jquery to validate certain inputs from the user. We created some basic input tags designed to take in a string, and then created functions in a separate .js file to grab the values from those inputs and decide whether or not the input was correctly formatted or do some other action with the input we receive. I definitely needed today, it felt good to just work and learn. <br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"05/06/2015",
		"title":"Elevator Pitch",
		"text":"My name is Brandon Brown, and I am a junior software developer at devCodeCamp in Waukesha, WI. I am familiar with Python  and JavaScript/jQuery. I have used the twitter api with python to create a basic twitter bot to find and reply to certain messages people send, and also with a team to extrapolate trending topics based on messages we received from a couple different locations in the U.S. I was responsible for implementing the code that allowed us to stream the data, and also worked with MongoDB in order to pick out certain pieces of the data we wanted to extrapolate from. As a security guard I learned to interact with many different kinds of people, and how to work independently to accomplish tasks. I have also trained in, and taught, martial arts for the last 14 years, which has given me alot of insight into the learning process, and helped me to learn how to formulate ideas and concepts into their tangible, practical application. Combine these traits with a teachable spirit, a passion for learning new things and developing myself, and an outgoing personality, I feel that I would be a perfect fit for your organization. Here, take my card.<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"05/07/2015",
		"title":"Math",
		"text":"Today was frustrating for a new and exciting reason. Well, perhapse not exciting, but certainly new. I have spent much of the day trying to create a form on  a webpage that could take in amounts of material (brick, wood, concrete, etc.) and use this information to auto display the total cost of the combined materials, and the square footage we could achieve with the given amount of materials based on an equation given to us with the materials required for one square foot of house. The coding part wasn't the issue, it was the math. I couldn't wrap my head around it at all. And spent most of the day in a fog of malcontent and hazy confusion. When I finally did get some help, the solution seemed so obvious. But I did finish the assignment and I am amped up to tackle the blog project on the morrow.<br/>-Brandon Brown<br/>:wq"
		},
		{
		"date":"05/08/2015",
		"title":"Blogoshtuff",
		"text":"Had a productive day today, but again, I failed to complete the assigned task in the allotted time. I worked on my blog website today, trying to implement some pagination and search functionality. I made a lot of headway, slow though it was. I am understanding jQuery more and more, which is great. But my brain is rather deflated today, and it has been really hard to stay focused. Hopefully this weekend will grant some clarity and peace of mind.<br>-Brandon Brown<br>:wq "
		},
		{
		"date":"05/11/2015",
		"title":"TroubleShot",
		"text":"I learned a lot of interesting things today about using the resources available to me. In Chrome, it is possible to see the html code of the elements on the page, and this is an incredibly useful tool. If at any point your not sure why something is acting the way it is, it's as easy as right clicking the element to find out why. Now you may not be able to find the underlying problem as easy as that, but it gives you a solid starting point. The other interesting thing is the power of using jQuery in your browser to affect the landscape of the html page in real time. It doesn't change the actual source code, but it's great for testing certain things and seeing how they will look before you hard code them. I was able to finish the pagination of my blog posts using this technique and it made the whole machine make a lot more sense to me. I can't wait to keep working on this blog, it's great to have a tangible representation of my efforts.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/12/2015",
		"title":"Jabber",
		"text":"Today was spent among the slightly terrifying and nigh indecipherable land of acronyms. I made a list of just a few that I got to deal with today. SRV, DNS, TLS, SASL, BOSH, XML... you might have the idea by now, but the point is now I have an idea as well, and it's great! I also set up a local web server to test and build my personal project in, and made great strides in learning about the Extensible Messaging and Presence Protocol, and even put some code together that worked! (Granted it only worked after it was pointed out to me that I had used the British spelling for one of my variable names) But even that cannot dampen my mood. I have a good handle on where to go next and I have some tangible methods of learning what I need to learn. I may end up making this deadline after all.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/13/2015",
		"title":"Everything is a String",
		"text":"The whole project is beginning to resolve itself in my mind, and I am finding that my progress is picking up speed. This is a very heartening occurence for me. I have spent so much time thinking that my time is being wasted when I need to just read and take in information. But the longer I look at the different examples and tutortials, I am gaining the ability to actually read what Is going on without a lot of head scratching and google searching. This is good but I still can't help but feel that it is taking too long given the deadlines I am faced with. I have no doubt that I will learn the things I want to learn, but I do have a doubt that I can do it fast enough.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/14/2015",
		"title":"Head down, code on.",
		"text":"It became abundantly clear to me that it is not about waiting for these concepts to be easier by osmosis, but instead establishing a genuine, deep, desire to to know as much as you can. Today was a huge mix of great moments and grinding halts, but at every turn a small cog would make a tiny bit more sense than it did the last time I saw it. I worked almost exlusively on my xmpp client today, and while it is live and running, it still doesn't do anything. I made monumental strides in my personal development, but just like yesterday, it's still not fast enough. I will very likely not have a minimum viable product by the end of the day tomorrow, but I can take a lot of pride that I am learning hard concepts, and learning to apply them in a very real way. If it's not fast enough for this course, so be it. It's priceless knowledge either way. All that being said, I ain't quittin till the fat lady sings.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/15/2015",
		"title":"Out of the woods.",
		"text":"So incredibly happy that it is friday. I definately burned the candle at both ends this week, but being able to watch my website update as I text from across the room on my iphone made all of the effort worth it. I am starting to get emotionally connected, and ideas are spinning up. Not only that but I am beginning to build the skill set necessary to do something about it. Aslo had a lot of fun working with the styling and seeing how I could make my website more aesthetically pleasing. I have so much more work to do. But at least I do not have to make an hour drive each way until monday. I'm looking forward to a cold drink, a warm bed, and the company of my beautiful wife... and coding of course.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/18/2015",
		"title":"And in to the fire.",
		"text":"We started the morning off with Demonstrations of our JavaScript project, and I am happy to say that I believe it went rather well. My stress level for the past week(while not pleasant) was highly effective in preparing me to give a talk on my peice of software. The fact that I have spent so much time in the code made it easy to find certain functions that were relevant very quickly. And forcing myself to understand the program better over the sleep-deprived weekend translated into a suprisingly cogent little walkthrough. After this exercise we were introduced to Visual Studio today, which is an IDE(Interactive Development Environment) based on the .NET framework. We are going to be using Visual Studio to creat c# applications, and today was mostly spent getting comfortable with the program, which seems quite powerful. It does give you a TON of shortcuts and allows you to use the GUI to generate code that matches the desired effect ie. dragging a button object from your toolbox and dropping it into your application will generate a new button function in your code that you can easily modify by double clicking the button you just created. It is nice to know that we will be sticking to one language for a while, and may actually have a little more time to explore what can be done with it.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/20/2015",
		"title":"Static",
		"text":"Today was a whirlwind sort of day, as I was doing my dead level best to rip through the 4 labs I missed yesterday due to illness, while digesting all of the new lecture material, and as new labs were being pushed. Spent a lot of time dealing with variable declaration, type casting, and string formatting. It is kinda cool that c# on top of .NET has so many diagnostic options hardcoded into the language, and Visual Studio makes it really easy to fake it if you don't exactly know how to move on, just start with the variable you want to manipulate(which was granted a type on instantiation) and adding a period on the end will net you a wonderful dropdown menu of all the operations that can be performed on that particular object type. Can't perform the action you need? Well that probably means you are going to have to cast your variable into the type that will allow your desired operation to be performed. Confused? Me too. Moving from a loosely typed language to a strongly typed language certainly complicates things a bit. But as it is an industry standard, I suppose we must all give the devil his due. I am excited to start learning some solid desktop application design, heres to hoping we get to that sooner rather than later.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/21/2015",
		"title":"Fun with Csharp",
		"text":"I was able to get caught up today, and it was a nice illustration of how far I've come that it was not difficult to trouble shoot my way through all the labs without much help. At least I was until the very end of the day when we got the final lab dealing with functions/methods. In which we were shotgun style introduced to the ideas of out, ref, parameter passing and method calling, and let loose. Now I'm confused. but that most likely has a lot to do with the lateness of the day. Really Got to spend some time playing around with python today, and that always puts me in a better mood. Mostly just looking forward to a nice three day weekend at this point. I am geared up to finish strong, but I'm am still incredibly nervous about my project presentation next wednesday, luckily I have a lot of time to work on it this weekend, but having an unfinished project looming over my head is definately taking it's toll on my brain. I have most of the different peices in place, but connecting them together is proving rather difficult. I can only trust that I will learn what I need to do in the time alotted, put my head down, and keep coding.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/22/2015",
		"title":"Clarity",
		"text":"I love OO design. It makes the thing I'm trying to do fit much better in my mind. I am not a math for math's sake kind of person, and when I'm looking at code that looks like a complicated series of equations I tend to get lost pretty quickly. That is not to say that I can't work through it and figure it out given some time, but presenting the data as an object, with intuitive functionality built in that can be 'organically' manipulated and stored makes it so much easier for me personally to integrate with it and understand it. I have been trying to learn these concepts since day one of this class, and it's nice to finally get some actual lecture time talking about these things, and to get some good solid class time in to work on them through labs geared toward learning how to build a class and building methods for that class. I don't think it will take very long at all for me to get really comfortable with using methods effectively, but I'm still pretty shaky right now. Fortunately I will be able to give my brain some rest time with the three day weekend coming up. Thats all I care to muse about at this point I hope that all 2 of the people who read this have a wonderful weekend.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/26/2015",
		"title":"Vision",
		"text":"I have been struggling recently with getting any kind of idea on what specific things I'd like to build with my new found knowledge, the ideas I have are either, non-functional, inane, or vast beyond my scope. I have come to realize that I have a hurdle that I absolutely must get past in order to get back on the move, and that hurdle is kind of hard to describe. Essentially, it seems that every time I try to approach a programmatical problem, I immediately jump to a solution that is two or three times more complex and convoluted than the problem itself warrants. I struggle with the ability to simplify and reduce. My vision gets clouded by all of the superfluous minutia, and I can't see to the heart of the problem, and it is in the heart of the problem, it's most basic iteration, that the solution is often found. After all, a solution is simply many small problems solved one at a time(or concurrently) that allow us to arrive at an answer. I need to change my perspective and look at the problems differently, but I haven't figured out how to do it yet. Perhapse as I settle in to a more bearable routine I may begin to see a way to see differently, but for now all I can do is keep my head down, and keep on coding on.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/27/2015",
		"title":"Memori",
		"text":"Today was largely geared towards preparing for our presentations of our projects. For the last few weeks we have been building a web application using the skills we have learned so far. I created a note storage application based on instant messaging, fully interactive from a chat client, with a single page javascript app that allows you to see a graphical layout of the notes you have stored and also offers some nice streamlined functionality for note manipulation. My presentation went quite well over all, but the biggest things I got out of today were features that I would really like to add to the application. Id like to extend the multiuser functionality to include things like note sharing or collaberation, a pseudo file system that allows you to sort your notes based on topic, Search fucntion both from the instant messanger and the web app, and a paginated content area to allow the user to have multiple 'corkboards' open at a time. I also have about ten new commands I would like my application to understand, so I have my work cut out for me, the frustrating thing is I have no time to work on it. But as my father said yesterday, hey, it is a personal project, you have your whole life to work on it. Looking forward to tinkering with it, and also looking forward to exploring c# a little more.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"05/29/2015",
		"title":"A day in the life",
		"text":"My favorite part of today was watching other people interact with the project I have been working on in class. It was really satisfying to see it work for another person and to have them give me positive feedback. As far as c# goes though, I'm still pretty shaky on a few of the core concepts, and that frustrates me quite a bit. Namespaces I get, classes I get, but some of the scope issues concerning when to use public and when to use private amd the getters and setters are tripping me up as well. I'm sure I'll get it eventually, but until then I just gotta keep working at it. Pretty excited to just play around this weekend, in leau of an assigned project, I'll probably be working on memory.I was able to get the help command working and displaying properly, and I am geared up to add some more features as soon as I get home. Have a great weekend, I know I will.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/01/2015",
		"title":"MVC",
		"text":"Model, View, Controller. The name of the game is design philosophy, and it is really nice to finally have a frame work in which to orginize my applications. It is really helpful to compartmentalize the functionality in a like minded way. The idea is that every thing that displays on the screen, or allows the user to interact with the application is going to be coded in the View area. None of the logical operation should be here, simply the code that renders the information. The operational code goes into a different space entirely, where all of the logic would go. The last area of code is what is called the model. This is where the data lives, the format for your data structure, and the different entities you want to be able to instantiate. This is also completely seperate from the logic section. This disign philosophy makes it much nicer to deal with a big program, and you can feel confident that if a problem with your display occurs, the best place to check first is going to be inside your 'view' code, the same should be true for your controllers and your models respectively. Of course this is all contingent on the developer following the conventions well. But it certainly does a good job of providing a great place to start.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/02/2015",
		"title":"Its like Mcdonald's",
		"text":"I'm loving it. I learn so much every day that sometimes it's hard to remember that even though I am more stressed than I have ever been in my life, I am actually learning and improving. I wish that I didn't feel so completely under the gun, and I wish I knew how to cut myself some slack, but I am making progress. I feel that I have a much more firm grasp OO design, and after today I also feel that I am getting a much better handle on the Model, view, controller design philosophy. It was pretty frustrating trying to figure out the correct razor syntax for generating the HTML, but I feel like that will just come with more time spent working with it. I forsee so many google searches in my future that I will be surprised if they aren't running anylitics on me when all is said and done. I continue to trust to hope that soon I will start to feel better about myself, but in the event that it doesn't change I have no problem putting my head down and continueing to work my &#*@ing ass off. Toodles!<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/04/2015",
		"title":"Work, work.",
		"text":"Now that we are getting in to the nitty gritty. I can definitely see a better indication of my progress. I feel like all I do on this blog is complain about my inability to learn things very well... and while I don't disagree with myself, I don't want to continue to beat the dead horse. It is after all, already dead. I am learning alot, and I demonstrated to myself today that I am beginning to show promise. We were given quite a few tasks today, and while they weren't easy, I was pretty happy with my ability to problem solve, I am no closer to likeing c-sharp at all, but I do feel closer to being a software engineer.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/05/2015",
		"title":"Back to the basics.",
		"text":"I spent a great deal of time today delving in to documentation. Documentation is something that I had perused on occasion for the express purpose of finding something to copy and paste that might get me closer to my goal. I had never thought of using it as a way to get more of a complete understanding of the subject I was dealing with. This was mostly due to the fact that the tasks I have been trying to complete thus far did not require an understanding of the code, library, or module I was using, I only needed to know the syntax to, for example, make a basic graph api call. But now I am facing a situation in which I can't achieve my goal with a basic run-of-the-mill call, I need to know how the api works and understand the avenues I can take to customize it for my use. I am quickly finding out the reading documentation is a fully fledged skillset in and of itself, lucky for me I will have ample time to hone that particular skill in the near, medium and far future. I learned a lot of good stuff, but I need to work on being able to differentiate between pertinent information and unnecessary information so as to not spend extra time learning something that doesn't get me closer to my goal. This problem also highlighted the need to be able to more accurately and succinctly describe my end goal to myself. There is nothing worse than trying to solve a problem when you are not really sure what the problem is. As per usual, I am glad it is Friday. Bottoms up!<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/08/2015",
		"title":"Flat is better than nested",
		"text":"I have been thinking a lot about how to write good, clean, readable code lately. Some of my classmates use non-descriptive variable names, methods that do 5 different things and don't return anything, and horrendously nested for loops. It makes it very difficult to look at their code, and even worse to try and help code along side them. I know that there are a lot of conventions and best practices that I won't be introduced to until I actually land a job, but I hope that my efforts in this department are not wasted. As we near the graduation date and the prospect of finding gainful employment looms on the horizon, I feel more and more confident in my burgeoning abilities. But I still feel that I am lacking certain fundamental knowledge when it come to going from start to finish on a project, i.e. design the code, write the code, test the code, create the final product, and lastly distribute the product. I don't really have a clear idea of how that process works in a commercial environment yet, I guess I just have to hope that they will teach me when the time comes to cross that bridge. Mondays are pretty horrible, and I'm infinitely grateful for the fact that I am done writing this, and I am one step closer to my beautiful wife waiting for me at home.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/09/2015",
		"title":"It's all just strings man!!!",
		"text":"I had a good initial interview today, I'd write more about it but honestly it went very well. I asked good questions, answered to the best of my abilities, and got the general vibe that they liked me. It is unfortunate really, I shine in the interpersonal department, but I need to look good on paper to get an interview, and in order to look good on paper I need to have looked good enough on paper at one point that I made it to the interview... it's all very confusing. Now everyone knows this conundrum exists, the hilarious part is no one gives a damn. There is this impossible standard out there and I have heard recruiters bald faced admit that this problem exists, and then go on to say 'deal with it'. But my decision to attend this school with the hopes that I would get some facetime with potential employers definitely panned out today, so I have that to be grateful for. As for code I was really happy with my skill level today, I was able to build a a program that would scan through a directory and any subdirectory therein, read any text files in said directory, and display a message when It found a file that matched the search parameters it was given, and I did it from scratch in about 10 minutes. Pretty easy struff maybe, but to me it was a real triumph.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/11/2015",
		"title":"Thankfully I'm charming",
		"text":"Much of today was geared toward getting my resume done. I don't mind telling you that I look like a semi literate buffoon on paper, and have traditionally relied on my stunning good looks and winning smile to land a job. But fortunately with a little professional wordsmithing and some good old fashoined elbow grease(mind grease? finger grease?) I discovered that there are actually a lot of good, desirable skills in my background, and now my beautiful resume reflects this. I've still got my panache, but having a solid resume to be proud of is definately a shiny penny in my pocket for this process. I responded to the email I recieved regarding my recent interview, and I remain optimistic about my progress thus far.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/15/2015",
		"title":"Holy buckets of time management batman!",
		"text":"Meetings, meetings, meetings. I got a little taste of what it is like to have waaaaaayyy too much to do, and also three hours of mandatory meetings to contend with. I am responsible for implementing chat functionality to the group project for my class, just as each member of my class has their own particular piece of the puzzle to create. Unlike the others in my class, I am also the project manager of the class that is two weeks into the program, and responsible for all the meetings and direction powows for that as well. I'm over whelmed and under qualified, but I've always said if theres one thing I can do really well. It is adapt to the situation. Let us hope I am up to the task this week. Toodles.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/18/2015",
		"title":"Sql",
		"text":"More of the same. Too much technology to learn, very little time to learn it in. I am continueing to feel overwhelmed and a little lost.  I am very proud of the work my team has accomplished so far this week. They are incredible and I am honored to have been able to be a part of their success. My own progress, however has been pretty much crap. I do feel that I have a little better direction now moving forward, and I am confident that I can have my updated requirement done for the end of the day on tommorrow.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/19/2015",
		"title":"Study first",
		"text":"I learned a very valuable to lesson this week. I have been struggling with the ASP.NET MVC framework for an assignment at school, and the week has been a lot of frustration and confusion as I became more and more lost. For some reason it never occured to me to check on line and see if perhaps their was some form of visual media in which someone might, you know, explain it in a very detailed, well thought out way. And it turns out the - you guessed it - that very thing exists! So while I am kicking myself for being so obtuse, I can't imagine that this is a lesson I will soon forget. I think I have definitely found the medium that I learn from the best. I have a plan for the weekend, I have a goal in mind, and I feel confident that I can accomplish it.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/22/2015",
		"title":"public static void main() {}",
		"text":"What a mouthful eh? Thats a simple signature that denotes quite a few different things. Public means that any one can access this method as long as they can see the class it's inside of. Static means that it cannot access instance methods or variables within a class, because it can only see static data. Void denotes the fact that this particular method is not going to return anything, as if not returning anything from the method wasn't explicit enough in saying that nothing will be returned... My day was spent with the finer points of these concepts, along with a plethora of other keywords like protected, private, abstract, and base. I guess I just need to get to memorizing them flash cards. I have been diving a lot more in to javascript for the last few days. And I am excited to see what I can turn out in the next couple of days. Sleep will just have to wait a little while longer.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/23/2015",
		"title":"Reevaluate, refacter, reengineer.",
		"text":"... Errrm. I think you mean start over, mulligan, throw away your code and do it differently. Is that what you meant? Ok good. I guess I'll go do that then. The first three solid hours of today was spent as a team trying to flesh out the requirements for our collaberation project. It seems that no one is really solid on what we are trying to accomplish, and as such are having trouble assessing what their next step should be. Hint *I was one of those people*. I'm sure it was tedious and boring for those in the team who already know what they are doing, but I don't really care, I am quite relieved to have a much clearer view of what I am trying to do. When I came back from lunch I had a new found vigor and was just getting into my groove when the ugly coding challenge monster reared it's ugly head and in true dcc fashion promptly tore me from my zone and didn't allow me to revisit what I was working on for the rest of the day. So I guess I'll try to find the magic understand button again tomorrow...<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/29/2015",
		"title":"Idea guy",
		"text":"I need one. We have just been given our next task, and for a project with so few requirements, it is certainly proving difficult to come up with a good idea. The project must meet three requirements, firstly, it needs to be something that would be impressive to a prospective employer. Secondly, it needs to be something we are passionate about, we have to be excited about what we are doing, and we need to feel confident in our ability to sell the finished product as something that is cool and useful. The last requirement is that it needs to be something we can accomplish in 40 man hours or less. I have a few ideas, and a lot of code that I would have liked to finish better, so I am hoping that I can come up with a good project that will allow me to revisit some of the things I have already worked on in more detail, and be able to build on top of. Time will tell if my measly cerebro-matter is up to the task. For now though, I am tired and thusly I save this document, and verily shall push the contents to this html page you are currently viewing.<br>-Brandon Brown<br>:wq"
		},
		{
		"date":"06/30/2015",
		"title":"Planning makes perfect",
		"text":"Today was not much of a coding day, but for once I wasnt completely frustrated by not getting any lines of code out. I feel confident that I have direction and a good set of requirements to work from, and this made it so that I didnt feel bad about spending some good time just researching and playing around with the technologies that I want to use. I learned a ton about RESTful apis, cURL, and also got to finally get my environment set up more to my liking. I was in sore need of a break day, and I just feel happy that I got to spend the day in self directed learning in a subject I chose for myself. I also learned some good techniques for study that I hope to refine and develop as I move forward in my career. But the biggest lesson for me is that I need to make the extra effort to cleanly and clearly lay out my tasks and work through them one at a time. I have always thought I was the captain of team wing-it, but apparently that could not be farther from the truth. I felt peace in knowing the particulars, now it becomes a matter of conquering my innate laziness and learning to be more effective with this knowledge. I hope this finds the readers well, and remember kids, read your error messages.<br>-Brandon Brown<br>:wq"
		}

	]
}
